---
kind: property
id: P:Autodesk.Revit.DB.Transform2D.IsIdentity
source: html/7c806384-bfde-4460-740d-f968fbdf36cc.htm
---
# Autodesk.Revit.DB.Transform2D.IsIdentity Property

The boolean value that indicates whether this transformation is an identity.

## Syntax (C#)
```csharp
public bool IsIdentity { get; }
```

## Remarks
The identity transformation does not change a point or a vector that it is applied to.